blog/2013/02/11/emacs-de-github-blog-sono1-markdown/index.html

<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>emacs@がんばらない。なまけもの必見！今度こそ継続できるBlogを10分でGithubに開設する。もちろん無料 - markdown編 - develog.me</title>
  <meta name="author" content="yunojy">

  
  <meta name="description" content="Blog投稿めんどくさ そもそも書くのがめんどくさい、開設めんどくさい、管理めんどくさい、投稿するのにログインするのめんどくさい、金かかるのありえない、別に情報公開してほめられたい訳でない、アフィリエイト？めんどくさい、なんとなくどこからでも読める備忘録がほしい、 &hellip;">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://yunojy.github.com/blog/2013/02/11/emacs-de-github-blog-sono1-markdown/">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <link href="/atom.xml" rel="alternate" title="develog.me" type="application/atom+xml">
  <!--Fonts from Google"s Web font directory at http://google.com/webfonts -->
<link href="http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">
<link href="http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">

  

</head>

<body   >
  <header role="banner"><hgroup>
  <h1><a href="/">develog.me</a></h1>
  
    <h2>開発＠がんばらない</h2>
  
</hgroup>

</header>
  <nav role="navigation"><ul class="subscription" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
  
<form action="http://google.com/search" method="get">
  <fieldset role="search">
    <input type="hidden" name="q" value="site:yunojy.github.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
  
<ul class="main-navigation">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div>
<article class="hentry" role="article">
  
  <header>
    
      <h1 class="entry-title">emacs@がんばらない。なまけもの必見！今度こそ継続できるBlogを10分でGithubに開設する。もちろん無料 - Markdown編</h1>
    
    
      <p class="meta">
        








  


<time datetime="2013-02-11T11:50:00+09:00" pubdate data-updated="true">Feb 11<span>th</span>, 2013</time>
        
      </p>
    
  </header>


<div class="entry-content"><div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Blog投稿めんどくさ</h2>
<div class="outline-text-2" id="text-1">

<p>  そもそも書くのがめんどくさい、開設めんどくさい、管理めんどくさい、投稿するのにログインするのめんどくさい、金かかるのありえない、別に情報公開してほめられたい訳でない、アフィリエイト？めんどくさい、なんとなくどこからでも読める備忘録がほしい、でもその程度の欲求なら大してがんばれない。それにemacsから出たくないし。そんな自分のための備忘録。
</p>
</div>

</div>




<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">概要</h2>
<div class="outline-text-2" id="text-2">

<p>  GithubをBlogにしちゃうOctopressを使って、1.ローカルで <code>.markdown</code> を書く。2.コンソールから一発コマンドを打つ。だけで投稿を可能にする環境を構築します。
</p>
</div>

</div>




<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">もくじ</h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>Octopress導入
</li>
<li>早速投稿とかしてみる
</li>
</ol>


</div>

</div>




<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">前提条件</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>Githubにアカウント作成済み
</li>
<li>GithubにSSH Key登録済み 
    手順はおまけに
</li>
<li>Mac 
    必須でもないが、Windowsだといろいろめんどくさい
</li>
<li><code>Ruby 1.9.3-p194</code> 
    管理にrbenv利用。途中、説明のコマンドはrbenv用、バージョン切替だけだからrvmでもかまわない
</li>
<li><code>octopress</code> 
    ・・バージョン？ <code>.rbenv-version</code> に <code>1.9.3-p194</code> って書いてあったバージョン
</li>
</ul>


</div>

</div>




<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">参考</h2>
<div class="outline-text-2" id="text-5">

<p>  <a href="http://www.hisasann.com/blog/2012/10/06/first-post/">Githubを使って独自ブログをはじめる方法メモ</a>
</p>

<hr/>


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Octopress導入</h3>
<div class="outline-text-3" id="text-5-1">


</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1">レポジトリを作る</h4>
<div class="outline-text-4" id="text-5-1-1">

<p>    <a href="https://github.com/new">Create a New Repository</a>
</p>
<p>
    次の名前でレポジトリを作る。
    [username]は自分の名前 <code>yunojy.github.com</code>
    <code>[username].github.com</code>
</p>
</div>

</div>

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2">OctopressをローカルPCへインストール（場所は任意）</h4>
<div class="outline-text-4" id="text-5-1-2">




<pre class="example"># githubからclone
% cd ~/repo
% git clone git://github.com/imathis/octopress.git octopress
% cd octopress

# 利用するrubyの設定(octopress)
% rbenv install 1.9.3-p194
% rbenv local 1.9.3-p194
% rbenv rehash

# bundleのインストール
% sudo gem install bundler
% bundle install

# octopressインストール
% rake install
% rake setup_github_pages
# 途中gitリポジトリのURLを入力

% rake generate
% rake deploy
</pre>


</div>

</div>

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3">ブログの設定</h4>
<div class="outline-text-4" id="text-5-1-3">




<pre class="example">% ~/repo/octopress
% emacs _config
</pre>


<pre class="example">url: http://yunojy.github.com
title: develog.me
subtitle: 開発＠がんばらない
author: yunojy
</pre>


</div>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">早速投稿とかしてみる</h3>
<div class="outline-text-3" id="text-5-2">



</div>

<div id="outline-container-5-2-1" class="outline-4">
<h4 id="sec-5-2-1">記事を書く</h4>
<div class="outline-text-4" id="text-5-2-1">




<pre class="example">% cd ~/repo/octopress
# 生成コマンド
% rake new_post
Enter a title for your post: first-post
mkdir -p source/_posts
Creating new post: source/_posts/2013-02-11-first-post.markdown

# 記事の中身を編集
% emacs source/_posts/2013-02-11-first-post.markdown
---
layout: post
title: "first-post"
date: 2013-02-11 9:45
comments: true
categories: スペース区切り。""不要
---
本文
</pre>


</div>

</div>

<div id="outline-container-5-2-2" class="outline-4">
<h4 id="sec-5-2-2">記事をBlogに反映</h4>
<div class="outline-text-4" id="text-5-2-2">

<p>    開設したばかりの初回は10分くらいかかる。以後すぐ
</p>


<pre class="example">% rake gen_deploy
</pre>


</div>

</div>

<div id="outline-container-5-2-3" class="outline-4">
<h4 id="sec-5-2-3">投稿した記事を閲覧する</h4>
<div class="outline-text-4" id="text-5-2-3">

<p>    <a href="http://yunojy.github.com">http://yunojy.github.com</a>
</p>
</div>

</div>

<div id="outline-container-5-2-4" class="outline-4">
<h4 id="sec-5-2-4">編集、削除する場合</h4>
<div class="outline-text-4" id="text-5-2-4">

<p>    そのまま <code>source/_posts/</code> 以下の <code>.markdown</code> を編集して <code>% rake gen_deploy</code>
</p>

<hr/>

</div>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">まとめ</h3>
<div class="outline-text-3" id="text-5-3">

<p>   以後、気が向いたときにコンソールから
</p>


<pre class="example">% cd ~/repo/octopress
% rake new_post
</pre>

<p>
   で、記事ファイル置き場に投稿ファイル作って、
</p>


<pre class="example">% emacs source/_posts/2013-02-11-first-post.markdown
---
layout: post
title: "first-post"
date: 2013-02-11 9:45
comments: true
categories:
---
ほんぶんここから
</pre>

<p>
   で、投稿ネタ書いて、
</p>


<pre class="example">% rake gen_deploy
</pre>

<p>
   で、大好きなmarkdownでgithubに投稿ができるようになります。
</p>
<p>
   あれ？めんどくさいぞ・・
</p>


<hr/>

</div>
</div>

</div>




<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">おまけ</h2>
<div class="outline-text-2" id="text-6">



</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">GithubにSSH Key登録</h3>
<div class="outline-text-3" id="text-6-1">

<p>   ※PC買い替えしたばかりなどで未登録の人だけ。
</p>
<p>   
   ※英語読めちゃう人は公式のこちら参照
   <a href="https://help.github.com/articles/generating-ssh-keys">Generating SSH Keys@github:help</a>
</p>

<ol>
<li>ローカルでSSHキーの生成



<pre class="example"># 既存バックアップ
% cd ~/.ssh
% ls -a
% mv -p id_rsa* backup

# 新しいKeyを生成
% ssh-keygen -t rsa -C "your_email@youremail.com"

# 生成キーをクリップボードへ
% pbcopy &lt; ~/.ssh/id_rsa.pub
</pre>


</li>
<li>GitHubに公開鍵を登録
      <a href="https://github.com/settings/ssh">https://github.com/settings/ssh</a>

<p>      
      &#8220;Add SSH Key&#8221;をクリック
      &#8220;Title&#8221;は適当に
      &#8220;Key&#8221;にはりつけ
</p>
</li>
<li>ローカルからSSH接続確認



<pre class="example"># git@github.comはそのまま
% ssh -T git@github.com
# 成功すれば、usernameが自分の名前で次のメッセージが表示される
Hi username! You've successfully authenticated, but GitHub does not provide shell access.
</pre>

</li>
</ol>


</div>
</div>
</div>

</div>


  <footer>
    <p class="meta">
      
  

<span class="byline author vcard">Posted by <span class="fn">yunojy</span></span>

      








  


<time datetime="2013-02-11T11:50:00+09:00" pubdate data-updated="true">Feb 11<span>th</span>, 2013</time>
      

<span class="categories">
  
    <a class='category' href='/blog/categories/emacs/'>emacs</a>, <a class='category' href='/blog/categories/octopress/'>octopress</a>, <a class='category' href='/blog/categories/org-mode/'>org-mode</a>
  
</span>


    </p>
    
      <div class="sharing">
  
  <a href="http://twitter.com/share" class="twitter-share-button" data-url="http://yunojy.github.com/blog/2013/02/11/emacs-de-github-blog-sono1-markdown/" data-via="" data-counturl="http://yunojy.github.com/blog/2013/02/11/emacs-de-github-blog-sono1-markdown/" >Tweet</a>
  
  
  
</div>

    
    <p class="meta">
      
        <a class="basic-alignment left" href="/blog/2013/02/11/test2-org/" title="Previous Post: test2-org">&laquo; test2-org</a>
      
      
    </p>
  </footer>
</article>

</div>

<aside class="sidebar">
  
    <section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/blog/2013/02/11/emacs-de-github-blog-sono1-markdown/">emacs@がんばらない。なまけもの必見！今度こそ継続できるBlogを10分でGithubに開設する。もちろん無料 - markdown編</a>
      </li>
    
      <li class="post">
        <a href="/blog/2013/02/11/test2-org/">test2-org</a>
      </li>
    
      <li class="post">
        <a href="/blog/2013/02/11/org-test/">org-test</a>
      </li>
    
      <li class="post">
        <a href="/blog/2013/02/11/first-post/">これはテスト記事です</a>
      </li>
    
  </ul>
</section>






  
</aside>


    </div>
  </div>
  <footer role="contentinfo"><p>
  Copyright &copy; 2013 - yunojy -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  







  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>





</body>
</html>
